W4D5/music_app/app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "year", "live", "created_at", "updated_at", "band_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", " new_al"], ["year", 2018], ["live", true], ["created_at", "2018-09-13 23:14:03.583428"], ["updated_at", "2018-09-13 23:14:03.583428"], ["band_id", 7]]
---
  def create
    @album = Album.new(album_params)

    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "SUPPPP  "], ["updated_at", "2018-09-13 23:33:58.261421"], ["id", 8]]
---
  def update
    @album = Album.find(params[:id])
    if @album.update(album_params)