W4D5/music_app/app/views/albums/_form.html.erb

SELECT "bands".* FROM "bands"
---
  <% end %>
<% Band.all.each do |band| %>