W4D5/music_app/app/views/albums/show.html.erb

<br>
<h3 style='text-align: center'>By: <%= (Band.find(@album.band_id)).name %></h3>
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]