W4D5/music_app/app/views/bands/show.html.erb


<% albums = Album.where(band_id: @band.id) %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 2]]